//
//  main.c
//  位运算
//
//  Created by udc on 2021/7/20.
//

#include <stdio.h>
void printBinary(int value);

int main(int argc, const char * argv[]) {
    // insert code here...
    printf("Hello, World!\n");
    
    //位运算是专门用于计算整型二进制的
    
    //1. & 规律是: 一假则假
    /*
     4 & 6
     0100
    &0110
     ----
     0100
     
     二进制中的每一位按位与1， 结果还是那一位
     9 & 15
     1001
    &1111
     ----
     1001
     
     */
    int res1 = 4 & 6;
    printf("res1 = %i\n", res1);
    
    
    //2. | 规律是: 一真则真
    /*
     4 | 6
     0100
     0110
     ----
     0110
     
     */
    int res2 = 4 | 6;
    printf("res2 = %i\n", res2);
    
    //3. ^ 规律是: 相同为假， 不同为真
    /*
     4 ^ 6
     0100
    ^0110
     ----
     0010
     
     二进制中一个数按位异或自己， 结果为0
     二进制中一个数按位异或0， 结果为自己
     二进制中一个数按位异或另一个数两次，结果为自己
     9 ^ 9
     1001
    ^1001
     ----
     0000
     
     6 ^ 0
     0110
     0000
     ----
     0110
     
     6 ^ 9 ^ 9
     0110
     1001
     ----
     1111
     1001
     ----
     0110
     
     */
    int res3 = 9 ^ 9;
    printf("res3 = %i\n", res3);
    
    
    //4. ~ 规律是: 真变假， 假变真
    /*
     ~4
     ~0100
     -------
     补码：1011
     反码：1010
     原码：1101 =》 最高位是1，不参与转换，所以该数是负数，-5
     
     */
    int res4 = ~4;
    printf("res4 = %i\n", res4);
    
    //5. 按位左移 <<
    //规律是: 左移多少位就是乘以2的多少次幂
    /*
     9 << 1
     0000 0000 0000 0000 0000 0000 0000 0000 参照物
     0000 0000 0000 0000 0000 0000 0000 1001
     左移一位之后，去掉溢出位，在右边补0
     000 0000 0000 0000 0000 0000 0000 10010 => 18
     
     
     9 << 2
     0000 0000 0000 0000 0000 0000 0000 0000 参照物
     0000 0000 0000 0000 0000 0000 0000 1001
     左移一位之后，去掉溢出位，在右边补0
     00 0000 0000 0000 0000 0000 0000 100100 => 36
     
     */
    int res5 = 9 << 1;
    printf("res5 = %i\n", res5);
    
    
    
    //6. 按位右移 >>
    //规律是: 右移多少位就是除以2的多少次幂
    /*
     9 >> 1
     0000 0000 0000 0000 0000 0000 0000 0000 参照物
     0000 0000 0000 0000 0000 0000 0000 1001
     右移一位之后，去掉溢出位，在左边补0
     00000 0000 0000 0000 0000 0000 0000 100 => 4
     
     
     9 >> 2
     0000 0000 0000 0000 0000 0000 0000 0000 参照物
     0000 0000 0000 0000 0000 0000 0000 1001
     右移2位之后，去掉溢出位，在左边补0
     000000 0000 0000 0000 0000 0000 0000 10 => 2
     
     */
    int res9 = 9 >> 2;
    printf("res9 = %i\n", res9);

    //-------------------------------
//    判断一个数是不是偶数
    int num = 6;
    ((num&1) == 0)? printf("YES\n") : printf("NO\n");
    
//    交换两个变量的值
    int a = 10;
    int b = 20;
    printf("a = %i, b = %i\n", a, b);
    a = a ^ b;
    b = a ^ b; //b = a ^ b ^ b
    a = a ^ b; //a = a ^ a ^ b
    printf("a = %i, b = %i\n", a, b);
    
//    输出一个二进制的每一位
    
    int numt = 9;
    printBinary(numt);
    
    
    
    
    
    return 0;
}
void printBinary(int value){
    int offset = 31;//记录右移位数
    while (offset >= 0) {//循环来控制不断右移
        int res = (value >> offset) & 1;
        printf("%i", res);
        offset--;
    }
    printf("\n");
}
